In [64]:
#impoertation des bibliotheques et chargement des datasets
import pandas as pd
import matplotlib.pyplot as plt
data = pd.read_csv('Average_Daily_Ridership_By_Mode - City of Philadelphia.csv')
df= pd.read_csv('Average_Daily_Ridership_By_Route - City of Philadelphia.csv')

Exploratory Data Analysis

In [ ]:
# Affichage des informations sur le dataset
display(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 492 entries, 0 to 491
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Calendar_Year            492 non-null    int64
 1   Calendar_Month           492 non-null    int64
 2   Mode                     492 non-null    object
 3   Average_Daily_Ridership  492 non-null    int64
 4   Source                   492 non-null    object
 5   ObjectId                 492 non-null    int64
dtypes: int64(4), object(2)
memory usage: 23.2+ KB

None

In [ ]:
# Affichage des premières lignes du dataset
display(data.head())

,Calendar_Year,Calendar_Month,Mode,Average_Daily_Ridership,Source,ObjectId
0,2019,1,Bus,459160,APC,1
1,2019,1,CCT,4294,Revenue,2
2,2019,1,Heavy Rail,296709,Revenue,3
3,2019,1,Regional Rail,122856,Revenue,4
4,2019,1,Trackless Trolley,16853,APC,5

In [ ]:
# Vérification des valeurs manquantes
display(data.isna().sum())

Calendar_Year              0
Calendar_Month             0
Mode                       0
Average_Daily_Ridership    0
Source                     0
ObjectId                   0
dtype: int64

In [ ]:
# Vérification des doublons
print("Duplicate rows in data:", data.duplicated().sum())

Duplicate rows in data: 0

In [ ]:
# Affichage des informations sur le dataset df
display(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10994 entries, 0 to 10993
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Calendar_Year            10994 non-null  int64
 1   Calendar_Month           10994 non-null  int64
 2   Route                    10994 non-null  object
 3   Average_Daily_Ridership  10994 non-null  int64
 4   Source                   10994 non-null  object
 5   ObjectId                 10994 non-null  int64
dtypes: int64(4), object(2)
memory usage: 515.5+ KB

None

In [ ]:
# Affichage des premières lignes du dataset df
display(df.head())

,Calendar_Year,Calendar_Month,Route,Average_Daily_Ridership,Source,ObjectId
0,2019,8,59,3811,APC,2
1,2019,8,60,8550,APC,3
2,2019,8,61,3563,APC,4
3,2019,8,62,226,APC,5
4,2019,8,64,4335,APC,6

In [ ]:
# Vérification des valeurs manquantes dans df
display(df.isna().sum())

Calendar_Year              0
Calendar_Month             0
Route                      0
Average_Daily_Ridership    0
Source                     0
ObjectId                   0
dtype: int64

In [ ]:
# Suppression des colonnes inutiles
data = data.drop(columns=["ObjectId","Source"])


print(data.columns.tolist())

['Calendar_Year', 'Calendar_Month', 'Mode', 'Average_Daily_Ridership']

In [ ]:
# Suppression des colonnes inutiles
df = df.drop(columns=["ObjectId","Source"])


print(df.columns.tolist())

['Calendar_Year', 'Calendar_Month', 'Route', 'Average_Daily_Ridership']

chicago

In [ ]:
# Chargement du dataset Chicago
df_chicago = pd.read_excel('CTA.xlsx')

In [ ]:
# Affichage des informations sur le dataset df_chicago
display(df_chicago.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9100 entries, 0 to 9099
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   service_date    9100 non-null   datetime64[ns]
 1   day_type        9100 non-null   object
 2   bus             9100 non-null   int64
 3   rail_boardings  9100 non-null   int64
 4   total_rides     9100 non-null   int64
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 355.6+ KB

None

In [ ]:
# Affichage des premières lignes du dataset df_chicago
display(df_chicago.head())

  service_date day_type     bus  rail_boardings  total_rides
0   2001-01-01        U  297192          126455       423647
1   2001-01-02        W  780827          501952      1282779
2   2001-01-03        W  824923          536432      1361355
3   2001-01-04        W  870021          550011      1420032
4   2001-01-05        W  890426          557917      1448343

In [ ]:
# Vérification des valeurs dupliquées dans df_chicago
display(df_chicago.duplicated().sum())

np.int64(0)

In [ ]:
# Vérification des valeurs manquantes dans df_chicago
display(df_chicago.isna().sum())

service_date      0
day_type          0
bus               0
rail_boardings    0
total_rides       0
dtype: int64

In [ ]:
# Conversion de la colonne 'service_date' en type datetime
df_chicago['service_date'] = pd.to_datetime(df_chicago['service_date'])

In [ ]:
# Filtrage des données entre 2019 et 2025
df_chicago_filtered = df_chicago[
    (df_chicago['service_date'] >= '2019-01-01') &
    (df_chicago['service_date'] <= '2025-12-31')
]

In [63]:
# 5. Vérification
print("Colonnes restantes :", df.columns)
print("Nombre de lignes après filtre :", len(df))
display(df.head())

Colonnes restantes : Index(['Calendar_Year', 'Calendar_Month', 'Route', 'Average_Daily_Ridership'], dtype='object')
Nombre de lignes après filtre : 10994

   Calendar_Year  Calendar_Month Route  Average_Daily_Ridership
0           2019               8    59                     3811
1           2019               8    60                     8550
2           2019               8    61                     3563
3           2019               8    62                      226
4           2019               8    64                     4335

In [ ]:
# Affichage des premières et dernières lignes du dataset filtré
display(df_chicago_filtered.head())
display(df_chicago_filtered.tail())

     service_date day_type     bus  rail_boardings  total_rides
6574   2019-01-01        U  248879          245852       494731
6575   2019-01-02        W  591006          573542      1164548
6576   2019-01-03        W  664442          627781      1292223
6577   2019-01-04        W  668812          628514      1297326
6578   2019-01-05        A  444434          348257       792691

     service_date day_type     bus  rail_boardings  total_rides
9095   2025-11-26        W  438551          301379       739930
9096   2025-11-27        U  181164          128476       309640
9097   2025-11-28        W  347522          242928       590450
9098   2025-11-29        A  249450          206685       456135
9099   2025-11-30        U  247697          185249       432946

In [62]:
# 5. Vérification
print("Colonnes restantes :", df.columns)
print("Nombre de lignes après filtre :", len(df))
display(df.head())

Colonnes restantes : Index(['Calendar_Year', 'Calendar_Month', 'Route', 'Average_Daily_Ridership'], dtype='object')
Nombre de lignes après filtre : 10994

   Calendar_Year  Calendar_Month Route  Average_Daily_Ridership
0           2019               8    59                     3811
1           2019               8    60                     8550
2           2019               8    61                     3563
3           2019               8    62                      226
4           2019               8    64                     4335

In [ ]:
# Sauvegarde des datasets nettoyés
data.to_csv('Average_Daily_Ridership_By_Mode_Cleaned.csv', index=False)
df.to_csv('Average_Daily_Ridership_By_Route_Cleaned.csv', index=False)
df_chicago_filtered.to_csv('CTA_Cleaned.csv', index=False)